# Homebrew Bundle file: https://github.com/Homebrew/homebrew-bundle
# Reference: https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f#best-practices-brew-cask-mas-and-cu
# Reference: https://www.programmingfonts.org/

# Homebrew Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "1password/tap"
tap "sourcegraph/src-cli"

# Homebrew Config
cask_args appdir: "/Applications/"

# Installed by Me
brew "mas"
# coreutils required for asdf-golang
brew "coreutils"
# xz required for asdf-python
brew "xz"
brew "zsh"
brew "git"
brew "gh"
brew "curl"
brew "jq"
brew "drone-cli"
brew "sourcegraph/src-cli/src-cli"
brew "asdf"
brew "saml2aws"
brew "neovim"
brew "ripgrep"
brew "aws-iam-authenticator"
cask "kitty"
cask "font-jetbrains-mono"
cask "1password"
cask "1password/tap/1password-cli"
cask "insomnia"
cask "sqlpro-for-postgres"
# Had to install manually
# cask "akiflow"

# Installed by Employer
# cask "firefox"
# cask "google-chrome"
# cask "zoom"
