# Homebrew Bundle file: https://github.com/Homebrew/homebrew-bundle
# Homebrew Cask setup
cask_args appdir: "/Applications"
tap "homebrew/cask"
# Mac App Store cli: https://github.com/mas-cli/mas
brew "mas"

brew "python"
brew "awscli"
brew "aws-iam-authenticator"
cask "aws-vault"
cask "authy"
brew "bash"
brew "bash-completion@2"
mas "com.amazon.Kindle", id: 405399194
cask "docker"
brew "git"
brew "golang"
cask "google-chrome"
brew "jq"
cask "kitty"
brew "kubectl"
brew "kops"
brew "kubectx"
brew "kubeseal"
brew "libpq", link: true, conflicts_with: ["postgres"]   # psql client
brew "neovim"
cask "postman"
brew "redis"
cask "slack"
cask "spotify"
cask "sqlpro-for-postgres"
brew "terraform"
brew "vault"
cask "viscosity"
cask "zoomus"
