# Homebrew Bundle file: https://github.com/Homebrew/homebrew-bundle

# Homebrew Cask setup
cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Mac App Store cli: https://github.com/mas-cli/mas
brew "mas"

brew "python"
brew "awscli"
brew "aws-iam-authenticator"
#cask "aws-vault"
cask "authy"
brew "bash"
brew "bash-completion@2"
brew "chruby"
mas "com.amazon.Kindle", id: 405399194
cask "docker"
brew "drone"
brew "git"
brew "golang"
#cask "google-chrome"
cask "font-fira-code"
cask "iterm2"
brew "jq"
#cask "kitty"
brew "kubectl"
brew "kops"
brew "kubectx"
#brew "kubernetes-helm"
brew "kubeseal"
brew "libpq", link: true, conflicts_with: ["postgres"]   # psql client
brew "neovim"
brew "node"
cask "postman"
brew "redis"
brew "ruby-build"
#cask "slack"
cask "spotify"
cask "sqlpro-for-postgres"
#brew "terraform@0.11"
brew "tfenv"
brew "vault"
cask "viscosity"
brew "yarn"
cask "zoomus"
